9/data/attachments/c7a77e1b777d4aea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_actions_b775d349-2eeb-4305-a8b7-27b2b2fa0725</nif:username>
            <nif:friendToBeAdded>Rodney_avoid_Actions_81023_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>